#include "PHYlib.h"
#include "DLLlib.h"
#include "RFlib.h"


/*************************************************************************/
/*                         小数据发送测试                               */
/*                     参数 ch设定测试的通讯频点                        */
/*                       发送字节数：12Byte /20Byte                            */
/*************************************************************************/
extern void TxTest_11(unsigned char ch);    //发送12字节
extern void TxTest_20(unsigned char ch);    //发送21字节
/*************************************************************************/
/*                    大数据发送测试发送测试                               */
/*                     参数 :ch设定测试的通讯频点                        */
/*                      发送字节数：250Byte                              */
/*************************************************************************/
extern void TxTest_250(unsigned char ch);   //发送250字节


/**************************************************************************/
/*                   数据接受测试，同时适应与小数据与大数据               */
/*                   参数 :ch设定测试的通讯频点：                         */
/***************************************************************************/
extern void RxTest(unsigned char ch);